In [1]:
import pandas as pd 
import numpy as np

In [70]:
data = {
    'Name': ['Ali', 'Hina', 'John', None, 'Liam'],
    'Age': [20, 22, None, 23, 21],
    'Salary': [25,np.nan, 30, 28, 999],
    'Grade': ['A', 'C', 'B', 'A', None],
    'Marks': [85, 60, 72, None, 90],
    'City': ['New York', None, 'Los Angeles', 'Chicago', 'Houston']
}

In [72]:
df = pd.DataFrame(data)
df

   Name   Age  Salary Grade  Marks         City
0   Ali  20.0    25.0     A   85.0     New York
1  Hina  22.0     NaN     C   60.0         None
2  John   NaN    30.0     B   72.0  Los Angeles
3  None  23.0    28.0     A    NaN      Chicago
4  Liam  21.0   999.0  None   90.0      Houston

In [47]:
print(df['Marks'].median())
df.describe()

78.5

             Age      Salary  Marks
count   5.000000    5.000000   4.00
mean   21.500000  222.200000  76.75
std     1.118034  434.248431  13.50
min    20.000000   25.000000  60.00
25%    21.000000   28.000000  69.00
50%    21.500000   29.000000  78.50
75%    22.000000   30.000000  86.25
max    23.000000  999.000000  90.00

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      float64
 2   Salary  4 non-null      float64
 3   Grade   4 non-null      object
 4   Marks   4 non-null      float64
 5   City    4 non-null      object
dtypes: float64(3), object(3)
memory usage: 372.0+ bytes

In [59]:
df.isnull().sum()

Name      0
Age       0
Salary    0
Grade     0
Marks     0
City      0
dtype: int64

In [74]:
age_mean=df['Age'].mean()

age_mean = int(age_mean)
marks_mean=df['Marks'].mean()

print(age_mean)

salary_median=df['Salary'].median()

df['Age'].fillna(age_mean, inplace=True)

df['Salary'].fillna(salary_median, inplace=True)

df['Grade'].fillna(df['Grade'].mode()[0], inplace=True)

df['Marks'].fillna(marks_mean, inplace=True)
df['City'].fillna("Unknown", inplace = True)

21

In [76]:
df.dropna(inplace=True)

In [77]:
df

   Name   Age  Salary Grade  Marks         City
0   Ali  20.0    25.0     A   85.0     New York
1  Hina  22.0    29.0     C   60.0      Unknown
2  John  21.0    30.0     B   72.0  Los Angeles
4  Liam  21.0   999.0     A   90.0      Houston